In [1]:
import sqlite3 as sq
sq.sqlite_version

'3.8.11'

In [2]:
conn=sq.connect('tysql.sqlite') #importing sql database
cur=conn.cursor() #defining the python cursor

In [3]:
cur.execute('SELECT prod_name FROM Products;') #return prod_name from Products
cur.fetchall()

[('8 inch teddy bear',),
 ('12 inch teddy bear',),
 ('18 inch teddy bear',),
 ('Fish bean bag toy',),
 ('Bird bean bag toy',),
 ('Rabbit bean bag toy',),
 ('Raggedy Ann',),
 ('King doll',),
 ('Queen doll',)]

In [4]:
cur.execute("SELECT prod_id, prod_name, prod_price FROM Products;") #return prod_id/name/price from Products
cur.fetchall()

[('BR01', '8 inch teddy bear', 5.99),
 ('BR02', '12 inch teddy bear', 8.99),
 ('BR03', '18 inch teddy bear', 11.99),
 ('BNBG01', 'Fish bean bag toy', 3.49),
 ('BNBG02', 'Bird bean bag toy', 3.49),
 ('BNBG03', 'Rabbit bean bag toy', 3.49),
 ('RGAN01', 'Raggedy Ann', 4.99),
 ('RYL01', 'King doll', 9.49),
 ('RYL02', 'Queen doll', 9.49)]

In [5]:
cur.execute("SELECT * FROM Products;") #return everything from Products table.
cur.fetchall()

[('BR01',
  'BRS01',
  '8 inch teddy bear',
  5.99,
  '8 inch teddy bear, comes with cap and jacket'),
 ('BR02',
  'BRS01',
  '12 inch teddy bear',
  8.99,
  '12 inch teddy bear, comes with cap and jacket'),
 ('BR03',
  'BRS01',
  '18 inch teddy bear',
  11.99,
  '18 inch teddy bear, comes with cap and jacket'),
 ('BNBG01',
  'DLL01',
  'Fish bean bag toy',
  3.49,
  'Fish bean bag toy, complete with bean bag worms with which to feed it'),
 ('BNBG02',
  'DLL01',
  'Bird bean bag toy',
  3.49,
  'Bird bean bag toy, eggs are not included'),
 ('BNBG03',
  'DLL01',
  'Rabbit bean bag toy',
  3.49,
  'Rabbit bean bag toy, comes with bean bag carrots'),
 ('RGAN01', 'DLL01', 'Raggedy Ann', 4.99, '18 inch Raggedy Ann doll'),
 ('RYL01',
  'FNG01',
  'King doll',
  9.49,
  '12 inch king doll with royal garments and crown'),
 ('RYL02',
  'FNG01',
  'Queen doll',
  9.49,
  '12 inch queen doll with royal garments and crown')]

In [6]:
cur.execute("SELECT DISTINCT vend_id FROM Products") #return distinct vend_id from Product table.
cur.fetchall()

[('BRS01',), ('DLL01',), ('FNG01',)]

In [7]:
cur.execute("SELECT prod_name FROM Products LIMIT 5,5;") #returns prod_name from Products table starting with the 5th one and giving the next 5.
cur.fetchall()

[('Rabbit bean bag toy',), ('Raggedy Ann',), ('King doll',), ('Queen doll',)]

In [8]:
cur.execute("SELECT prod_name FROM Products ORDER BY prod_name;") #Order by a column, must be last in statement
cur.fetchall()

[('12 inch teddy bear',),
 ('18 inch teddy bear',),
 ('8 inch teddy bear',),
 ('Bird bean bag toy',),
 ('Fish bean bag toy',),
 ('King doll',),
 ('Queen doll',),
 ('Rabbit bean bag toy',),
 ('Raggedy Ann',)]

In [9]:
cur.execute("SELECT prod_id, prod_price, prod_name FROM Products ORDER BY prod_price, prod_name;") #retrieve and order by more than one column
cur.fetchall()

[('BNBG02', 3.49, 'Bird bean bag toy'),
 ('BNBG01', 3.49, 'Fish bean bag toy'),
 ('BNBG03', 3.49, 'Rabbit bean bag toy'),
 ('RGAN01', 4.99, 'Raggedy Ann'),
 ('BR01', 5.99, '8 inch teddy bear'),
 ('BR02', 8.99, '12 inch teddy bear'),
 ('RYL01', 9.49, 'King doll'),
 ('RYL02', 9.49, 'Queen doll'),
 ('BR03', 11.99, '18 inch teddy bear')]

In [10]:
cur.execute("SELECT prod_name, prod_price FROM Products WHERE prod_price <= 100;") #return prod_name/price where the price is less than or equal to $100.
cur.fetchall()

[('8 inch teddy bear', 5.99),
 ('12 inch teddy bear', 8.99),
 ('18 inch teddy bear', 11.99),
 ('Fish bean bag toy', 3.49),
 ('Bird bean bag toy', 3.49),
 ('Rabbit bean bag toy', 3.49),
 ('Raggedy Ann', 4.99),
 ('King doll', 9.49),
 ('Queen doll', 9.49)]

In [11]:
cur.execute("SELECT prod_id, prod_name FROM Products WHERE prod_name LIKE '%bean bag%';") #return prod_id/name where the prod_name contains something like "bean bag"
cur.fetchall()

[('BNBG01', 'Fish bean bag toy'),
 ('BNBG02', 'Bird bean bag toy'),
 ('BNBG03', 'Rabbit bean bag toy')]

In [12]:
cur.execute("SELECT prod_id, prod_name FROM Products WHERE prod_name LIKE '__ inch teddy bear';") 
cur.fetchall()

[('BR02', '12 inch teddy bear'), ('BR03', '18 inch teddy bear')]

In [13]:
cur.execute("SELECT cust_contact FROM Customers WHERE cust_contact LIKE '%';") #return cust_contact where it is a wildcard (%)
cur.fetchall()

[('John Smith',),
 ('Michelle Green',),
 ('Jim Jones',),
 ('Denise L. Stephens',),
 ('Kim Howard',)]

In [14]:
cur.execute("SELECT vend_name || '(' || vend_country || ')' FROM Vendors ORDER BY vend_name;") #return and format vend_name/county from Vendors table
cur.fetchall()

[('Bear Emporium(USA)',),
 ('Bears R Us(USA)',),
 ('Doll House Inc.(USA)',),
 ('Fun and Games(England)',),
 ('Furball Inc.(USA)',),
 ('Jouets et ours(France)',)]

In [15]:
cur.execute("SELECT vend_name || '(' || vend_country || ')' AS vend_title FROM Vendors ORDER BY vend_name;") #same as last but sets it as the vend_title
cur.fetchall()

[('Bear Emporium(USA)',),
 ('Bears R Us(USA)',),
 ('Doll House Inc.(USA)',),
 ('Fun and Games(England)',),
 ('Furball Inc.(USA)',),
 ('Jouets et ours(France)',)]

In [16]:
cur.execute("SELECT prod_id, quantity, item_price, quantity*item_price AS expanded_price FROM OrderItems WHERE order_num=20008;") #return prod_id/quantity/item_price and the calculated expanded price for order number 20008 
cur.fetchall()

[('RGAN01', 5, 4.99, 24.950000000000003),
 ('BR03', 5, 11.99, 59.95),
 ('BNBG01', 10, 3.49, 34.900000000000006),
 ('BNBG02', 10, 3.49, 34.900000000000006),
 ('BNBG03', 10, 3.49, 34.900000000000006)]

In [17]:
cur.execute("SELECT 2*3")
cur.fetchall()

[(6,)]

In [18]:
cur.execute("SELECT AVG(prod_price) AS avg_price FROM Products;") #return average price
cur.fetchall()

[(6.823333333333334,)]

In [19]:
cur.execute("SELECT COUNT(*) AS num_cust FROM Customers;")#return the number of customers
cur.fetchall()

[(5,)]

In [20]:
cur.execute("SELECT COUNT(cust_email) AS num_cust FROM Customers;") #return the number of customers who have an email address.
cur.fetchall()

[(3,)]

In [21]:
cur.execute("SELECT SUM(quantity) AS items_ordered FROM OrderItems WHERE order_num=20005;") #return the number of items in order number 20005
cur.fetchall()

[(200,)]

In [22]:
cur.execute("SELECT AVG(DISTINCT prod_price) FROM Products WHERE vend_id='DLL01';") #return the average price of distinct products from vender number DLL01
cur.fetchall()

[(4.24,)]

In [23]:
cur.execute("SELECT COUNT(*), MIN(prod_price), MAX(prod_price), AVG(prod_price) FROM Products;") #return the number of, minimum price, maximum price, and average price of products in Products table.
cur.fetchall()

[(9, 3.49, 11.99, 6.823333333333334)]

In [24]:
cur.execute("SELECT cust_id, COUNT(*) AS orders FROM Orders GROUP BY cust_id HAVING COUNT(*)>=2;") #return cust_id and the number of orders for customers who have order 2 or more times.
cur.fetchall()

[('1000000001', 2)]

In [26]:
cur.execute("SELECT cust_name, cust_state, (SELECT COUNT(*) FROM Orders WHERE Orders.cust_id=Customers.cust_id) AS orders FROM Customers ORDER BY cust_name;")
cur.fetchall() #return the cust_name/state and number of orders. this joins the results from two tables.

[('Fun4All', 'IN', 1),
 ('Fun4All', 'AZ', 1),
 ('Kids Place', 'OH', 0),
 ('The Toy Store', 'IL', 1),
 ('Village Toys', 'MI', 2)]

In [31]:
cur.execute("SELECT cust_name, cust_contact FROM Customers WHERE cust_id IN (SELECT cust_id FROM Orders WHERE order_num IN (SELECT order_num FROM OrderItems WHERE prod_id='RGAN01'));")
cur.fetchall() #returns cust_name/contac where the customer has an order that includes the product RGAN01

[('Fun4All', 'Denise L. Stephens'), ('The Toy Store', 'Kim Howard')]

In [33]:
cur.execute("SELECT vend_name, prod_name, prod_price FROM Vendors, Products WHERE Vendors.vend_id=Products.vend_id;")
cur.fetchall() #return vend_name and prod_name/price. this joins the vendors and products tables.

[('Bears R Us', '8 inch teddy bear', 5.99),
 ('Bears R Us', '12 inch teddy bear', 8.99),
 ('Bears R Us', '18 inch teddy bear', 11.99),
 ('Doll House Inc.', 'Fish bean bag toy', 3.49),
 ('Doll House Inc.', 'Bird bean bag toy', 3.49),
 ('Doll House Inc.', 'Rabbit bean bag toy', 3.49),
 ('Doll House Inc.', 'Raggedy Ann', 4.99),
 ('Fun and Games', 'King doll', 9.49),
 ('Fun and Games', 'Queen doll', 9.49)]

In [37]:
cur.execute("SELECT prod_name, vend_name, prod_price, quantity FROM OrderItems, Products, Vendors " +
           " WHERE Products.vend_id=Vendors.vend_id AND OrderItems.prod_id=Products.prod_id AND order_num=20007;")
cur.fetchall() #returns from 3 different tables and sets the connects for each table in the WHERE clause.

[('18 inch teddy bear', 'Bears R Us', 11.99, 50),
 ('Fish bean bag toy', 'Doll House Inc.', 3.49, 100),
 ('Bird bean bag toy', 'Doll House Inc.', 3.49, 100),
 ('Rabbit bean bag toy', 'Doll House Inc.', 3.49, 100),
 ('Raggedy Ann', 'Doll House Inc.', 4.99, 50)]

In [52]:
cur.execute(("SELECT C.*, O.order_num, O.order_date, OI.prod_id, OI.quantity, OI.item_price " + 
             " FROM Customers AS C, Orders AS O, OrderItems AS OI " + 
             " WHERE C.cust_id=O.cust_id AND OI.order_num=O.order_num AND prod_id='RGAN01';"))
cur.fetchall() #joins 3 tables and uses shorthand variables for the table names

[('1000000004',
  'Fun4All',
  '829 Riverside Drive',
  'Phoenix',
  'AZ',
  '88888',
  'USA',
  'Denise L. Stephens',
  'dstephens@fun4all.com',
  20007,
  '2012-01-30',
  'RGAN01',
  50,
  4.49),
 ('1000000005',
  'The Toy Store',
  '4545 53rd Street',
  'Chicago',
  'IL',
  '54545',
  'USA',
  'Kim Howard',
  None,
  20008,
  '2012-02-03',
  'RGAN01',
  5,
  4.99)]

In [53]:
cur.execute("SELECT cust_name, cust_contact, cust_email FROM Customers "+ 
            " WHERE cust_state IN ('IL','IN', 'MI') " + 
           " UNION " + 
           " SELECT cust_name, cust_contact, cust_email FROM Customers "+
           " WHERE cust_name='Fun4All';")
cur.fetchall() #1st select returns all customers in those state and the 2nd select returns the Fun4All customer. Duplicates are taken care of.

[('Fun4All', 'Denise L. Stephens', 'dstephens@fun4all.com'),
 ('Fun4All', 'Jim Jones', 'jjones@fun4all.com'),
 ('The Toy Store', 'Kim Howard', None),
 ('Village Toys', 'John Smith', 'sales@villagetoys.com')]

In [57]:
cur.execute("INSERT INTO Customers(cust_id, cust_name, cust_address, cust_city, cust_state, cust_zip, cust_country, cust_contact, cust_email)" + 
            " VALUES ('1000000006', 'Toy Land', '123 Any Street', 'New York', 'NY', '11111', 'USA', NULL, NULL);")
cur.execute("SELECT * FROM Customers;")
cur.fetchall() #inserts a new customer into the Customers table.

[('1000000001',
  'Village Toys',
  '200 Maple Lane',
  'Detroit',
  'MI',
  '44444',
  'USA',
  'John Smith',
  'sales@villagetoys.com'),
 ('1000000002',
  'Kids Place',
  '333 South Lake Drive',
  'Columbus',
  'OH',
  '43333',
  'USA',
  'Michelle Green',
  None),
 ('1000000003',
  'Fun4All',
  '1 Sunny Place',
  'Muncie',
  'IN',
  '42222',
  'USA',
  'Jim Jones',
  'jjones@fun4all.com'),
 ('1000000004',
  'Fun4All',
  '829 Riverside Drive',
  'Phoenix',
  'AZ',
  '88888',
  'USA',
  'Denise L. Stephens',
  'dstephens@fun4all.com'),
 ('1000000005',
  'The Toy Store',
  '4545 53rd Street',
  'Chicago',
  'IL',
  '54545',
  'USA',
  'Kim Howard',
  None),
 ('100000006',
  'Toy Land',
  '123 Any Street',
  'New York',
  'NY',
  '11111',
  'USA',
  None,
  None),
 ('1000000006',
  'Toy Land',
  '123 Any Street',
  'New York',
  'NY',
  '11111',
  'USA',
  None,
  None)]

In [59]:
cur.execute("UPDATE Customers SET cust_email='kim@thetoystore.com' WHERE cust_id='1000000005';")
cur.execute("SELECT * FROM Customers;")
cur.fetchall() #updates the email address for that cust_id value.

[('1000000001',
  'Village Toys',
  '200 Maple Lane',
  'Detroit',
  'MI',
  '44444',
  'USA',
  'John Smith',
  'sales@villagetoys.com'),
 ('1000000002',
  'Kids Place',
  '333 South Lake Drive',
  'Columbus',
  'OH',
  '43333',
  'USA',
  'Michelle Green',
  None),
 ('1000000003',
  'Fun4All',
  '1 Sunny Place',
  'Muncie',
  'IN',
  '42222',
  'USA',
  'Jim Jones',
  'jjones@fun4all.com'),
 ('1000000004',
  'Fun4All',
  '829 Riverside Drive',
  'Phoenix',
  'AZ',
  '88888',
  'USA',
  'Denise L. Stephens',
  'dstephens@fun4all.com'),
 ('1000000005',
  'The Toy Store',
  '4545 53rd Street',
  'Chicago',
  'IL',
  '54545',
  'USA',
  'Kim Howard',
  'kim@thetoystore.com'),
 ('100000006',
  'Toy Land',
  '123 Any Street',
  'New York',
  'NY',
  '11111',
  'USA',
  None,
  None),
 ('1000000006',
  'Toy Land',
  '123 Any Street',
  'New York',
  'NY',
  '11111',
  'USA',
  None,
  None)]

In [60]:
cur.execute("CREATE TABLE CustCopy AS SELECT * FROM Customers;")
cur.execute("SELECT * FROM CustCopy;") 
cur.fetchall() #makes a copy of the customers table

[('1000000001',
  'Village Toys',
  '200 Maple Lane',
  'Detroit',
  'MI',
  '44444',
  'USA',
  'John Smith',
  'sales@villagetoys.com'),
 ('1000000002',
  'Kids Place',
  '333 South Lake Drive',
  'Columbus',
  'OH',
  '43333',
  'USA',
  'Michelle Green',
  None),
 ('1000000003',
  'Fun4All',
  '1 Sunny Place',
  'Muncie',
  'IN',
  '42222',
  'USA',
  'Jim Jones',
  'jjones@fun4all.com'),
 ('1000000004',
  'Fun4All',
  '829 Riverside Drive',
  'Phoenix',
  'AZ',
  '88888',
  'USA',
  'Denise L. Stephens',
  'dstephens@fun4all.com'),
 ('1000000005',
  'The Toy Store',
  '4545 53rd Street',
  'Chicago',
  'IL',
  '54545',
  'USA',
  'Kim Howard',
  'kim@thetoystore.com'),
 ('100000006',
  'Toy Land',
  '123 Any Street',
  'New York',
  'NY',
  '11111',
  'USA',
  None,
  None),
 ('1000000006',
  'Toy Land',
  '123 Any Street',
  'New York',
  'NY',
  '11111',
  'USA',
  None,
  None)]

In [63]:
cur.execute("DELETE FROM CustCopy WHERE cust_id='100000006';")
cur.execute("SELECT * FROM CustCopy;")
cur.fetchall() #deletes the row from CustCopy table where the id is as specified.

[('1000000001',
  'Village Toys',
  '200 Maple Lane',
  'Detroit',
  'MI',
  '44444',
  'USA',
  'John Smith',
  'sales@villagetoys.com'),
 ('1000000002',
  'Kids Place',
  '333 South Lake Drive',
  'Columbus',
  'OH',
  '43333',
  'USA',
  'Michelle Green',
  None),
 ('1000000003',
  'Fun4All',
  '1 Sunny Place',
  'Muncie',
  'IN',
  '42222',
  'USA',
  'Jim Jones',
  'jjones@fun4all.com'),
 ('1000000004',
  'Fun4All',
  '829 Riverside Drive',
  'Phoenix',
  'AZ',
  '88888',
  'USA',
  'Denise L. Stephens',
  'dstephens@fun4all.com'),
 ('1000000005',
  'The Toy Store',
  '4545 53rd Street',
  'Chicago',
  'IL',
  '54545',
  'USA',
  'Kim Howard',
  'kim@thetoystore.com')]

In [66]:
cur.execute("DROP TABLE CustCopy;") #deletes this table